In [23]:
import pandas

#    index      0        1     2     3
student1 = ['hong', '홍길동', 23, '경기']
print(student1)

['hong', '홍길동', 23, '경기']

In [3]:
student2 = pandas.Series(student1)
print(student2)

0    hong
1     홍길동
2      23
3      경기
dtype: object

In [9]:
print( type(student1) )
print( type(student2) )
student2[1]

<class 'list'>
<class 'pandas.core.series.Series'>

'홍길동'

In [14]:
student3 = {'id':'hong', 'name':'홍길동', 'age':23, 'addr':'경기'}
student4 = pandas.Series(student3)
print(student3)
print('-' * 15)
print(student4)

{'id': 'hong', 'name': '홍길동', 'age': 23, 'addr': '경기'}
---------------
id      hong
name     홍길동
age       23
addr      경기
dtype: object

In [34]:
#    index      0        1     2     3
student1 = ['hong', '홍길동', 23, '경기']
student2 = pandas.Series(student1)
student3 = pandas.Series(student1, index = ['아이디', '이름', '나이', '주소'])
print(student2)
print()
print(student3)

0    hong
1     홍길동
2      23
3      경기
dtype: object

아이디    hong
이름      홍길동
나이       23
주소       경기
dtype: object

In [36]:
print(student3['이름'])
print(student3[2])

홍길동
23

In [38]:
student1 = ['hong', '홍길동', 'A', 80, 90, 67, 88, 90]
student2 = pandas.Series(student1, index = ['id', 'name', 'class', 'kor',
                                            'eng', 'math', 'sci', 'his'])
print(student1, end = '\n\n')
print(student2)

['hong', '홍길동', 'A', 80, 90, 67, 88, 90]

id       hong
name      홍길동
class       A
kor        80
eng        90
math       67
sci        88
his        90
dtype: object

In [42]:
# 인덱싱  : Series['index이름'], Series[index번호]
# 슬라이싱: Series['이름1':'이름2'] - 이름1이상부터 이름2이하까지
#           Series[번호1:번호2]     - 번호1이상부터 번호2미만까지
# 여러개의 개별 인덱싱: 순서와 상관없이 임의의 위치에 index들을 조회할 수 있다.
#           Series[['이름1', '이름2', '이름3']], Series[[번호1, 번호2, 번호3]]
print(student2['name'])
print(student2[3])
print()
print(student2['kor':'sci'])
print(student2[3:6])
print()
print(student2[['name', 'sci', 'id']])
print(student2[[1, 6, 0]])

홍길동
80

kor     80
eng     90
math    67
sci     88
dtype: object
kor     80
eng     90
math    67
dtype: object

name     홍길동
sci       88
id      hong
dtype: object
name     홍길동
sci       88
id      hong
dtype: object

In [46]:
# 사전 = {키1:목록1, 키2:목록2, 키3:목록3}
# 키들을 column명(열이름)이 되고,
# 각 목록의 원소들을 같은 열에 순서대로 나열되고,
# 순서대로 정수 index를 부여받는다.
dict_data = {'name':['홍길동', '황진이', '멍멍이', '야옹이'],
             'kor' :[80, 90, 76, 55],
             'eng' :[85, 93, 80, 48],
             'math':[82, 91, 77, 64]}
df = pandas.DataFrame(dict_data)
df

  name  kor  eng  math
0  홍길동   80   85    82
1  황진이   90   93    91
2  멍멍이   76   80    77
3  야옹이   55   48    64

In [51]:
# 2차원 목록은 원소들일 1차원 목록들이
# 각 행(row)을 이루면서 DataFrame 객체가 생성된다.
# 단, 원소를 참조할 수 있는 값을 index번호가 기본이고,
# 행과 열 모두 index번호로 만들어진다.
list_data = [['홍길동', 80, 85, 82],
             ['황진이', 90, 93, 91],
             ['멍멍이', 76, 80, 77],
             ['야옹이', 55, 48, 62]]
df = pandas.DataFrame(list_data, columns = ['name', 'kor', 'eng', 'math'],
                      index = ['hong', 'hwang', 'dog', 'cat'])
df

      name  kor  eng  math
hong   홍길동   80   85    82
hwang  황진이   90   93    91
dog    멍멍이   76   80    77
cat    야옹이   55   48    62

In [58]:
list_data = [[15, '남', '덕영중'], [17, '여', '수리중']]
df = pandas.DataFrame(list_data, columns = ['나이', '성별', '학교'],
                      index = ['준서', '예은'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [67]:
dict_data = {'나이':[15, 17], '성별':['남', '여'], '학교':['덕영중', '수리중']}
df = pandas.DataFrame(dict_data, index = ['준서', '예은'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [76]:
df2 = df.copy()
print(df2.columns)
print(df2.index)
df2.columns = ['연령', '남녀', '출신']
df2.index   = ['학생1', '학생2']
df2

Index(['나이', '성별', '학교'], dtype='object')
Index(['준서', '예은'], dtype='object')

     연령 남녀   출신
학생1  15  남  덕영중
학생2  17  여  수리중

In [91]:
# df2.columns = ['컬럼명1', '컬럼명2', ...]          - 모든 컬럼명을 변경
# df2.rename({'old명1':'new명1', 'old명2':'new명2'}) - 일부 컬럼명이나 인덱스명을 변경
#             axis = 0 / 'index'    - 인덱스명 변경
#             axis = 1 / 'columns'  - 컬럼명 변경
df2 = df.copy()
print(df2.columns)
print(df2.index)
df2.rename({'나이':'연령', '학교':'소속'}, axis = 1, inplace = True)
df2.rename({'예은':'학생2'}, axis = 'index')
df2

Index(['나이', '성별', '학교'], dtype='object')
Index(['준서', '예은'], dtype='object')

    연령 성별   소속
준서  15  남  덕영중
예은  17  여  수리중